БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОбращенияВТехПоддержкуБИТ/ОбращенияВТехПоддержкуБИТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбращенияВТехПоддержкуБИТ</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ТипЗапроса</name>
    <type>
      <types>EnumRef.ТипыЗапросовТехПоддержкаБИТ</types>
    </type>
  </resources>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТекстСлужебнойИнформации</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗапросовТехПоддержкаБИТ</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеОбОшибках</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>УИДСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОбращенияВТехПоддержкуБИТ/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоУдалятьЧужие = ПравоДоступа("ЧтениеИсторииДанных", Метаданные.РегистрыСведений.ОбращенияВТехПоддержкуБИТ);
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "БылаПопыткаОтправитьЗапросНаЛК" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗапросНаЛК(Команда)
	ОткрытьФорму("РегистрСведений.ОбращенияВТехПоддержкуБИТ.ФормаЗаписи");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапросНаЛК(Команда)
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ОтправитьЗапросНаЛКСервер(ТД.УИДСообщения);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗапросыНаЛКПередУдалением(Элемент, Отказ)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() <> 1 Тогда
		Отказ = Истина;
	Иначе
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекущиеДанные.ДатаОтправки) Тогда
			Отказ = Истина;
			
		ИначеЕсли Не ЕстьПравоУдалятьЧужие
				И ТекущийПользователь <> ТекущиеДанные.Пользователи
		Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Состояние("Недопустимое удаление");
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОтправитьЗапросНаЛКСервер(УИДСообщения)
	РегистрыСведений.ОбращенияВТехПоддержкуБИТ.СоздатьНаборЗаписей().ОбработатьОтправкуЗапросаНаЛКПоУИД(УИДСообщения);		
КонецПроцедуры

#КонецОбласти
